clear all %这个M文件是计算第一道题（3），（5）问的程序
clc
syms d1 theta2 theta3 x1 x2 x3 %如果需要得到表达式就用这段程序
% theta2=pi/6; 如果需要计算具体数值就用这段程序
% theta3=pi/6;
% x1=1;
% x2=2;
% x3=1;
% d1=1;
A1=[cos(0),-sin(0),0,0;sin(0),cos(0),0,0;0,0,1,d1;0,0,0,1];
A2=[1,0,0,x1;0,1,0,0;0,0,1,0;0,0,0,1];
A=A1*A2;
B1=[cos(theta2),-sin(theta2),0,0;sin(theta2),cos(theta2),0,0;0,0,1,0;0,0,0,1];
B2=[1,0,0,x2;0,1,0,0;0,0,1,0;0,0,0,1];
B=B1*B2;
C1=[cos(theta3),-sin(theta3),0,0;sin(theta3),cos(theta3),0,0;0,0,1,0;0,0,0,1];
C2=[1,0,0,x3;0,1,0,0;0,0,1,0;0,0,0,1];
C=C1*C2;
X=A*B*C
R1=A(1:3,1:3);
R2=B(1:3,1:3);
R3=C(1:3,1:3);
z0=[0,0,1].';
z1=R1*z0;
z2=R1*R2*z0;
z3=R1*R2*R3*z0;
p0=[0,0,0].';
p1=A(1:3,4);
D=A*B;
p2=D(1:3,4);
p3=X(1:3,4);
J=[cross(z0,(p3-p0)),cross(z1,(p3-p1)),cross(z2,(p3-p2));z0,z1,z2]